#include <stdio.h>

int main() {
    float x, y;

    // Введення координат точки А
    printf("Введіть координату x: ");
    scanf("%f", &x);
    printf("Введіть координату y: ");
    scanf("%f", &y);

    // Визначення квадранта, у якому знаходиться точка
    if (x > 0 && y > 0) {
        printf("Точка знаходиться в першому квадраті.\n");
    } else if (x < 0 && y > 0) {
        printf("Точка знаходиться в другому квадраті.\n");
    } else if (x < 0 && y < 0) {
        printf("Точка знаходиться в третьому квадраті.\n");
    } else if (x > 0 && y < 0) {
        printf("Точка знаходиться в четвертому квадраті.\n");
    } else if (x == 0 && y == 0) {
        printf("Точка знаходиться в початку координат.\n");
    } else {
        printf("Точка знаходиться на одній з координатних осей.\n");
    }

    return 0;
}
