// Алгоритм, який визначає, чи точка (x,y) лежить поза колом радiуса r з
// центром в точцi (1,0).

//підключення бібліотек 
#include <stdio.h>
#include <math.h>

int main() {
    double r;  // Змінна для радіуса кола
    // Зміні координати центра кола
    double centerX = 1.0;
    double centerY = 0.0;

    // Введення радіуса кола
    printf("Введіть радіус кола: ");
    scanf("%lf", &r);

    // Зміні Координат точок
    double x, y;

    // Введення координати x
    printf("Введіть координату x: ");
    scanf("%lf", &x);

    // Введення координати y
    printf("Введіть координату y: ");
    scanf("%lf", &y);

    // Визначення відстані від точки до центру кола за допомогою формули відстані 
    double distance = sqrt((x - centerX) * (x - centerX) + (y - centerY) * (y - centerY));

    // Перевірка значень точки
    if (distance > r) {
        printf("Точка лежить поза колом\n");
    } else if (distance < r) {
        printf("Точка лежить всередині кола\n");
    } else {
        printf("Точка лежить на колі\n");
    }

    return 0;
}
